package ch05;

public class _07_ArrayExMain {
	public static void main(String[] args) {
		   /*
	     * *** 성적표 ***
	     * ================================
	     * 번호   국어   영어   수학   총점   평균   학점
	     * ================================
	     *  1   100  100  100  300  100  A
	     *  2    90   90   90  270   90  A
	     *  3    70   70   70  210   70  C
	     *  4   70  100  100  300  100  A
	     *  5   60  100  100  300  100  A
	     *  ==============================
	     *  과목합계  390  390  390   
	     *  
	     *  평균 : 소수점 이하 둘째자리
	     *  2찬원배열명 => scores  국,영,수 점수는 주어진 값
	     *  총점(sum),  평균(avg), 학점, 과목합계(korTot, engTot, mathTot)는 직접계산
	     */
		
		_07_ArrayEx[][] student = new _07_ArrayEx[5][3];
		
		
		
		
		
	}

}
